###############################################################################
# Created by write_sdc
###############################################################################
current_design counter
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 5.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[0]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[1]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[2]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[3]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[4]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[5]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[6]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[7]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {csb0}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[0]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[10]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[11]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[12]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[13]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[14]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[15]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[1]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[2]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[3]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[4]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[5]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[6]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[7]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[8]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[9]}]
set_input_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[0]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[10]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[11]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[12]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[13]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[14]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[15]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[1]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[2]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[3]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[4]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[5]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[6]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[7]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[8]}]
set_output_delay 2.5000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[9]}]
###############################################################################
# Environment
###############################################################################
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {csb0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
